<!-- placeholder-1 -->
```fish
terraform plan -chdir='terraform/development' -detailed-exitcode -lock=false -out=tf.plan
```
<!-- placeholder-2 -->

<details><summary>Diff of changes.</summary>

```diff
+ aws_default_security_group.default will be created
+ aws_instance.grafana_server will be created
+ aws_internet_gateway.gitops_igw will be created
+ aws_route_table.gitops_rt will be created
+ aws_route_table_association.gitops_rta will be created
+ aws_security_group.grafana_sg will be created
+ aws_subnet.gitops_subnet will be created
+ aws_vpc.gitops_vpc will be created
+ aws_vpc_security_group_egress_rule.grafana_egress will be created
+ aws_vpc_security_group_ingress_rule.grafana_ingress will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 10 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @chris3ware at 2024-10-22T19:30:08Z [(view log)](https://github.com/3ware/gitops-2024/actions/runs/11467182282/job/31909500484#step::1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_instance.grafana_server will be created
  + resource "aws_instance" "grafana_server" {
      + ami                                  = "ami-005fc0f236362e99f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "grafana-server-development"
        }
      + tags_all                             = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "grafana-server-development"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "829fb476176e8de655d5449a8790a17650f3af0e"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.gitops_igw will be created
  + resource "aws_internet_gateway" "gitops_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "gitops-igw-development"
        }
      + tags_all = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "gitops-igw-development"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.gitops_rt will be created
  + resource "aws_route_table" "gitops_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "gitops-rt-development"
        }
      + tags_all         = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "gitops-rt-development"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.gitops_rta will be created
  + resource "aws_route_table_association" "gitops_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.grafana_sg will be created
  + resource "aws_security_group" "grafana_sg" {
      + arn                    = (known after apply)
      + description            = "Grafana Server security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "grafana_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.gitops_subnet will be created
  + resource "aws_subnet" "gitops_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "gitops-subnet-development"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "gitops-subnet-development"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.gitops_vpc will be created
  + resource "aws_vpc" "gitops_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "gitops-vpc-development"
        }
      + tags_all                             = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "gitops-vpc-development"
        }
    }

  # aws_vpc_security_group_egress_rule.grafana_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "grafana_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Outbound traffic from grafana server"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "grafana-egress-sg-rule-development"
        }
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "grafana-egress-sg-rule-development"
        }
    }

  # aws_vpc_security_group_ingress_rule.grafana_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "grafana_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Inbound traffic to grafana web interface"
      + from_port              = 3000
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "grafana-ingress-sg-rule-development"
        }
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "grafana-ingress-sg-rule-development"
        }
      + to_port                = 3000
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_account_id = (sensitive value)
  + default_tags   = {
      + "3ware:environment"          = "development"
      + "3ware:managed-by-terraform" = "true"
      + "3ware:project-id"           = "gitops-2024"
      + "3ware:workspace"            = "app-us-east-1-development"
    }
```
</details>
<!-- placeholder-5 -->
<!-- terraform.29...chdir..terraform.development..tf.plan -->
<!-- placeholder-6 -->